/******************************************************************************************
 * 文件:    slc/m1_plc.c
 *
 * 说明:    机1的PLC定义
 *
 * 作者:    Jun
 *
 * 时间:    2011-4-9
******************************************************************************************/
#define  SLC_M1_PLC_C
#include <includes.h>

#define ___USE_PLC_DEF___    /* PLC-ACTION定义 */
#define ___THIS_SLC___  1

#include "common.h"

BOOL m1_start_plc(void)
{
    return slc_start_plc();
}

BOOL m1_stop_plc(void)
{
    return slc_stop_plc();
}

void m1_plc_initialize(void)
{
    ___initialize_about_plc();
}

/*=========================================================================================
 * 
 * 本文件结束: slc/m1_plc.c
 * 
**=======================================================================================*/

