/******************************************************************************************
 * 文件:    slc/m2_plc.c
 *
 * 说明:    机2的PLC定义
 *
 * 作者:    Jun
 *
 * 时间:    2011-4-9
******************************************************************************************/
#define  SLC_M2_PLC_C
#include <includes.h>

#define ___USE_PLC_DEF___    /* PLC-ACTION定义 */
#define ___THIS_SLC___  2

#include "common.h"

BOOL m2_start_plc(void)
{
    return slc_start_plc();
}

BOOL m2_stop_plc(void)
{
    return slc_stop_plc();
}

void m2_plc_initialize(void)
{
    ___initialize_about_plc();
}

/*=========================================================================================
 * 
 * 本文件结束: slc/m2_plc.c
 * 
**=======================================================================================*/

