/******************************************************************************************
 * 文件:    slc/slc_mntr.h
 *
 * 描述:    刀线位置监控
 *
 * 作者:    Jun
******************************************************************************************/
#ifndef SLC_MONITOR_H
#define SLC_MONITOR_H


/*-----------------------------------------------------------------------------------------
 * 
 *      SLC_MNTR风格
 * 
**---------------------------------------------------------------------------------------*/
#define  SLC_MNTR_STYLE_BORDER           0x0001       /* 边框         */
#define  SLC_MNTR_STYLE_SUBSIDE          0x0002       /* 下沉         */
#define  SLC_MNTR_STYLE_CLIENT_BDR       0x0004       /* CLIENT边框   */
#define  SLC_MNTR_STYLE_MODAL_FRAME      0x0008       /* 模式框       */

/*-----------------------------------------------------------------------------------------
 * 
 *      分压机状态定义(序号)
 * 
**---------------------------------------------------------------------------------------*/
#define  SLC_STATUS_START       0
#define  SLC_STATUS_FIXED       1
#define  SLC_STATUS_K_UP        2
#define  SLC_STATUS_K_DN        3
#define  SLC_STATUS_L_UP        4
#define  SLC_STATUS_L_DN        5
#define  SLC_STATUS_MANUAL      6
#define  SLC_STATUS_ORDCHG      7
#define  SLC_STATUS_STOP        8
#define  SLC_STATUS_MAX_NR      9

/*-----------------------------------------------------------------------------------------
 * 
 *      刀线状态(会影响图标的显示)
 * 
**---------------------------------------------------------------------------------------*/
#define  KL_STATE_NONE          0   /* 未选中 */
#define  KL_STATE_SLCT          1   /* 已选中 */
#define  KL_STATE_DOWN          2   /* 刀线下 */
#define  KL_STATE_BLINK         4   /* 闪烁中 */

/*-----------------------------------------------------------------------------------------
 * 
 *      函数声明
 * 
**---------------------------------------------------------------------------------------*/
gui_widget * init_slc_monitor_screen(void);
void enter_slc_monitor(int machine);



#endif /* #ifndef SLC_MONITOR_H */

/*=========================================================================================
 * 
 * 本文件结束: slc/slc_mntr.h
 * 
**=======================================================================================*/


